/*
 * Copyright 2003
 *     Bang Jun-Young.  All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. All advertising materials mentioning features or use of this software
 *    must display the following acknowledgement:
 *	This product includes software developed by Bang Jun-Young.
 * 4. The name of the author may not be used to endorse or promote products
 *    derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
 * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY

	FileMailslotQueryInformation,
	FileMailslotSetInformation,
	FileCompressionInformation,
	FileObjectIdInformation,
	FileCompletionInformation,
	FileMoveClusterInformation,
	FileQuotaInformation,
	FileReparsePointInformation,
	FileNetworkOpenInformation,
	FileAttributeTagInformation,
	FileTrackingInformation,
	FileMaximumInformation
} FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef enum _FSINFOCLASS {
	FileFsVolumeInformation = 1,
	FileFsLabelInformation,
	FileFsSizeInformation,
	FileFsDeviceInformation,
	FileFsAttributeInformation,
	FileFsControlInformation,
	FileFsFullSizeInformation,
	FileFsObjectIdInformation,
	FileFsMaximumInformation
} FS_INFORMATION_CLASS, *PFS_INFORMATION_CLASS;

typedef enum _KEY_INFORMATION_CLASS {
	KeyBasicInformation,
	KeyNodeInformation,
	KeyFullInformation,
	KeyNameInformation
} KEY_INFORMATION_CLASS;

typedef enum _KEY_SET_INFORMATION_CLASS {
	KeyWriteTimeInformation
} KEY_SET_INFORMATION_CLASS;

typedef enum _KEY_VALUE_INFORMATION_CLASS {
	KeyValueBasicInformation,
	KeyValueFullInformation,
	KeyValuePartialInformation,
	KeyValueFullInformationAlign64,
	KeyValuePartialInformationAlign64
} KEY_VALUE_INFORMATION_CLASS;

typedef enum _ATOM_INFORMATION_CLASS {
	AtomBasicInformation,
	AtomListInformation
} ATOM_INFORMATION_CLASS;

typedef enum _EVENT_INFORMATION_CLASS {
	EventBasicInformation
} EVENT_INFORMATION_CLASS;

typedef enum _IO_COMPLETION_INFORMATION_CLASS {
	IoCompletionBasicInformation
} IO_COMPLETION_INFORMATION_CLASS;

typedef enum _MUTANT_INFORMATION_CLASS {
	MutantBasicInformation
} MUTANT_INFORMATION_CLASS;

typedef enum _SEMAPHORE_INFORMATION_CLASS {
	SemaphoreBasicInformation
} SEMAPHORE_INFORMATION_CLASS;

typedef enum _TIMER_INFORMATION_CLASS {
	TimerBasicInformation
} TIMER_INFORMATION_CLASS;

typedef enum _PORT_INFORMATION_CLASS {
	PortBasicInformation
} PORT_INFORMATION_CLASS;

typedef enum _AUDIT_EVENT_TYPE {
	AuditEventObjectAccess,
	AuditEventDirectoryServiceAccess
} AUDIT_EVENT_TYPE, *PAUDIT_EVENT_TYPE;

typedef enum _SHUTDOWN_ACTION {
	ShutdownNoReboot,
	ShutdownReboot,
	ShutdownPoweroff
} SHUTDOWN_ACTION;

typedef enum _EVENT_TYPE {
	NotificationEvent,
	SynchronizationEvent
} EVENT_TYPE;

typedef enum _TIMER_TYPE {
	NotificationTimer,
	SynchronizationTimer
} TIMER_TYPE;

typedef enum _WAIT_TYPE {
	WaitAll,
	WaitAny
} WAIT_TYPE, *PWAIT_TYPE;

typedef enum _KPROFILE_SOURCE {
	ProfileTime
} KPROFILE_SOURCE;

typedef enum _DEBUG_CONTROL_CODE {
	DebugGetTraceInformation = 1,
	DebugSetInternalBreakpoint,
	DebugSetSpecialCall,
	DebugClearSpecialCalls,
	DebugQuerySpecialCalls,
	DebugDbgBreakPoint
} DEBUG_CONTROL_CODE;

typedef enum _LPC_TYPE {
	LPC_NEW_MESSAGE,
	LPC_REQUEST,
	LPC_REPLY,
	LPC_DATAGRAM,
	LPC_LOST_REPLY,
	LPC_PORT_CLOSED,
	LPC_CLIENT_DIED,
	LPC_EXCEPTION,
	LPC_DEBUG_EVENT,
	LPC_ERROR_EVENT,
	LPC_CONNECTION_REQUEST
} LPC_TYPE;

/*
 * Type definitions.
 */

typedef struct _RTL_BITMAP {
	DWORD  SizeOfBitMap;
	PDWORD Buffer;
} RTL_BITMAP, *PRTL_BITMAP, **PPRTL_BITMAP;

typedef struct _IO_STATUS_BLOCK {
	union {
		NTSTATUS Status;
		PVOID Pointer;
	};
	ULONG_PTR Information;
} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK;

typedef struct _CLIENT_ID {
	HANDLE UniqueProcess;
	HANDLE UniqueThread;
} CLIENT_ID, *PCLIENT_ID;

typedef struct _PORT_BASIC_INFORMATION {
	/* Does not have any members. */
} PORT_BASIC_INFORMATION, *PPORT_BASIC_INFORMATION;

typedef struct _SYSTEM_STRINGS {
	UNICODE_STRING SystemRoot;
	UNICODE_STRING System32Root;
	UNICODE_STRING BaseNamedObjects;
} SYSTEM_STRINGS, *PSYSTEM_STRINGS, **PPSYSTEM_STRINGS;

typedef struct _TEXT_INFO {
	PVOID Reserved;
	PSYSTEM_STRINGS SystemStrings;
} TEXT_INFO, *PTEXT_INFO, **PPTEXT_INFO;

typedef VOID (*PIO_APC_ROUTINE)(PVOID, PIO_STATUS_BLOCK, ULONG);
typedef VOID (*PTIMER_APC_ROUTINE)(PVOID, ULONG, LONG);
typedef VOID (*PKNORMAL_ROUTINE)(PVOID, PVOID, PVOID);
struct _KAPC;
typedef VOID (*PKKERNEL_ROUTINE)(struct _KAPC *, PKNORMAL_ROUTINE *, PVOID *,
    PVOID *, PVOID *);
typedef VOID (*PKRUNDOWN_ROUTINE)(struct _KAPC *);

typedef struct _KAPC {
	SHORT Type;
	SHORT Size;
	DWORD Spare0;
	struct _KTHREAD *Thread;
	LIST_ENTRY ApcListEntry;
	PKKERNEL_ROUTINE KernelRoutine;
	PKRUNDOWN_ROUTINE RundownRoutine;
	PKNORMAL_ROUTINE NormalRoutine;
	PVOID NormalContext;
	PVOID SystemArgument1;
	PVOID SystemArgument2;
	CHAR ApcStateIndex;
	KPROCESSOR_MODE ApcMode;
	BOOLEAN Inserted;
} KAPC, *PKAPC, **PPKAPC;

typedef struct _FILE_BASIC_INFORMATION {
	LARGE_INTEGER CreationTime;
	LARGE_INTEGER LastAccessTime;
	LARGE_INTEGER LastWriteTime;
	LARGE_INTEGER ChangeTime;
	ULONG FileAttributes;
} FILE_BASIC_INFORMATION, *PFILE_BASIC_INFORMATION;

/*
 * XXX should be in ntddk.h
 */
typedef struct _FILE_STANDARD_INFORMATION {
	LARGE_INTEGER AllocationSize;
	LARGE_INTEGER EndOfFile;
	ULONG NumberOfLinks;
	BOOLEAN DeletePending;
	BOOLEAN Directory;
} FILE_STANDARD_INFORMATION, *PFILE_STANDARD_INFORMATION;

typedef struct _FILE_POSITION_INFORMATION {
	LARGE_INTEGER CurrentByteOffset;
} FILE_POSITION_INFORMATION, *PFILE_POSITION_INFORMATION;

typedef struct _FILE_END_OF_FILE_INFORMATION {
	LARGE_INTEGER EndOfFile;
} FILE_END_OF_FILE_INFORMATION, *PFILE_END_OF_FILE_INFORMATION;

typedef struct _FILE_FULL_EA_INFORMATION {
	ULONG NextEntryOffset;
	UCHAR Flags;
	UCHAR EaNameLength;
	USHORT EaValueLength;
	CHAR EaName[1];
} FILE_FULL_EA_INFORMATION, *PFILE_FULL_EA_INFORMATION;

typedef struct _FILE_GET_EA_INFORMATION {
	ULONG NextEntryOffset;
	UCHAR EaNameLength;
	CHAR EaName[1];
} FILE_GET_EA_INFORMATION, *PFILE_GET_EA_INFORMATION;

typedef struct _FILE_USER_QUOTA_INFORMATION {
	ULONG NextEntryOffset;
	ULONG SidLength;
	LARGE_INTEGER ChangeTime;
	LARGE_INTEGER QuotaUsed;
	LARGE_INTEGER QuotaThreshold;
	LARGE_INTEGER QuotaLimit;
	SID Sid[1];
} FILE_USER_QUOTA_INFORMATION, *PFILE_USER_QUOTA_INFORMATION;

typedef struct _FILE_QUOTA_LIST_INFORMATION {
	ULONG NextEntryOffset;
	ULONG SidLength;
	SID Sid[1];
} FILE_QUOTA_LIST_INFORMATION, *PFILE_QUOTA_LIST_INFORMATION;

typedef struct _FILE_FS_DEVICE_INFORMATION {
	DEVICE_TYPE DeviceType;
	ULONG Characteristics;
} FILE_FS_DEVICE_INFORMATION, *PFILE_FS_DEVICE_INFORMATION;

typedef struct _FILE_COMPLETION_INFORMATION {
	HANDLE IoCompletionHandle;
	ULONG CompletionKey;
} FILE_COMPLETION_INFORMATION, *PFILE_COMPLETION_INFORMATION;

typedef struct _PORT_MESSAGE_HEADER {
/*000*/	USHORT DataSize;
/*002*/	USHORT MessageSize;
/*004*/	USHORT MessageType;
/*006*/	USHORT VirtualRangesOffset;
/*008*/	CLIENT_ID ClientId;
/*010*/	ULONG MessageId;
/*014*/	ULONG SectionSize;
} PORT_MESSAGE_HEADER, *PPORT_MESSAGE_HEADER;
typedef struct _PORT_MESSAGE_HEADER PORT_MESSAGE, *PPORT_MESSAGE;

typedef struct _CSRSS_MESSAGE_HEADER {		/* XXX */
/*000*/	ULONG Unknown1;
/*004*/	ULONG Opcode;
/*008*/	ULONG Status;
/*00C*/	ULONG Unknown2;
} CSRSS_MESSAGE_HEADER;

typedef struct _CSR_MESSAGE_HEADER {			/* XXX */
/*000*/	struct _PORT_MESSAGE_HEADER;
/*018*/	struct _CSRSS_MESSAGE_HEADER;
} CSR_MESSAGE_HEADER, *PCSR_MESSAGE_HEADER;
typedef struct _CSR_MESSAGE_HEADER CSR_MESSAGE, *PCSR_MESSAGE;

typedef struct _PORT_SECTION_WRITE {
	ULONG Length;
	HANDLE SectionHandle;
	ULONG SectionOffset;
	ULONG ViewSize;
	PVOID ViewBase;
	PVOID TargetViewBase;
} PORT_SECTION_WRITE, *PPORT_SECTION_WRITE;

typedef struct _PORT_SECTION_READ {
	ULONG Length;
	ULONG ViewSize;
	ULONG ViewBase;
} PORT_SECTION_READ, *PPORT_SECTION_READ;

typedef struct _KEY_VALUE_ENTRY {
	PUNICODE_STRING ValueName;
	ULONG DataLength;
	ULONG DataOffset;
	ULONG Type;
} KEY_VALUE_ENTRY, *PKEY_VALUE_ENTRY;

typedef struct _USER_STACK {
	PVOID FixedStackBase;
	PVOID FixedStackLimit;
	PVOID ExpandableStackBase;
	PVOID ExpandableStackLimit;
	PVOID ExpandableStackBottom;
} USER_STACK, *PUSER_STACK;

typedef struct _OBJECT_TYPE_LIST {
	WORD Level;
	WORD Sbz;
	GUID *ObjectType;
} OBJECT_TYPE_LIST, *POBJECT_TYPE_LIST;

/*
 * Thread Environment Blocks are located at 0x7FFDE000, 0x7FFDD000,
 * 0x7FFDC000, and so on.
 */
typedef struct _TEB {
/*000*/	NT_TIB Tib;
/*01C*/	PVOID EnvironmentPointer;
/*020*/	CLIENT_ID Cid;
/*028*/	HANDLE RpcHandle;
/*02C*/	PPVOID ThreadLocalStorage;
/*030*/	struct _PEB *Peb;
/*034*/	DWORD LastErrorValue;
/*038*/	BYTE Reserved_038[116];
/*0AC*/	PVOID Unknown_0AC;
/*0B0*/	BYTE Reserved_0B0[20];
/*0C4*/	LCID Locale;
/*0C8*/	BYTE Reserved_0C8[1752];
/*7A0*/	PVOID Reserved_7A0[277];
/*BF4*/	NTSTATUS LastStatusValue;
/*BF8*/	UNICODE_STRING UnicodeString;
/*C00*/	WCHAR UnicodeBuffer[262];
/*E0C*/	PVOID Reserved_E0C;
/*E10*/	PVOID TlsSlots[64];
/*F10*/	BYTE Reserved_F10[8];
/*F18*/	PVOID Reserved_F18[4];
/*F28*/	ULONG HardErrorDisabled;	/* XXX BOOL? */
/*F2C*/	PVOID Reserved_F2C[21];
/*F80*/	PVOID ReservedForOle;
/*F84*/	PVOID Reserved_F84[4];
/*F94*/	PVOID TlsExpansionSlots;
} TEB, *PTEB, **PPTEB;

typedef struct _PROCESS_PARAMETERS {
/*000*/	ULONG AllocationSize;
/*004*/	ULONG Size;
/*008*/	ULONG Flags;
/*00C*/	ULONG Zero;
/*010*/	LONG Console;
/*014*/	ULONG ProcessGroup;
/*018*/	HANDLE StdInput;
/*01C*/	HANDLE StdOutput;
/*020*/	HANDLE StdError;
/*024*/	UNICODE_STRING CurrentDirectoryName;
/*02C*/	HANDLE CurrentDirectoryHandle;
/*030*/	UNICODE_STRING DllPath;
/*038*/	UNICODE_STRING ImageFile;
/*040*/	UNICODE_STRING CommandLine;
/*048*/	PWSTR Environment;
/*04C*/	ULONG X;
/*050*/	ULONG Y;
/*054*/	ULONG XSize;
/*058*/	ULONG YSize;
/*05C*/	ULONG XCountChars;
/*060*/	ULONG YCountChars;
/*064*/	ULONG FillAttribute;
/*068*/	ULONG Flags2;
/*06C*/	ULONG ShowWindow;
/*070*/	UNICODE_STRING WindowTitle;
/*078*/	UNICODE_STRING Desktop;
/*080*/	UNICODE_STRING Reserved;
/*088*/	UNICODE_STRING Reserved2;
} PROCESS_PARAMETERS, *PPROCESS_PARAMETERS;

typedef struct _MODULE_HEADER {
	DWORD Unknown[2];
	LIST_ENTRY LoadOrder;
	LIST_ENTRY MemOrder;
	LIST_ENTRY InitOrder;
} MODULE_HEADER, *PMODULE_HEADER, **PPMODULE_HEADER;

typedef struct _PROCESS_MODULE_INFO {
/*000*/	DWORD Size;
#if 0
	MODULE_HEADER ModuleHeader;
#else
/*004*/	DWORD Unknown[2];
/*00C*/	LIST_ENTRY LoadOrder;
/*014*/	LIST_ENTRY MemOrder;
/*01C*/	LIST_ENTRY InitOrder;
#endif
} PROCESS_MODULE_INFO, *PPROCESS_MODULE_INFO, **PPPROCESS_MODULE_INFO;

/*
 * Module flags.
 */
#define STATIC_LINK		0x00000002
#define IMAGE_DLL		0x00000004
#define LOAD_IN_PROGRESS	0x00001000
#define UNLOAD_IN_PROGRESS	0x00002000
#define ENTRY_PROCESSED		0x00004000
#define ENTRY_INSERTED		0x00008000
#define CURRENT_LOAD		0x00010000
#define FAILED_BUILTIN_LOAD	0x00020000
#define DONT_CALL_FOR_THREAD	0x00040000
#define PROCESS_ATTACH_CALLED	0x00080000
#define DEBUG_SYMBOLS_LOADED	0x00100000
#define IMAGE_NOT_AT_BASE	0x00200000
#define WX86_IGNORE_MACHINETYPE	0x00400000

typedef struct _MODULE_ENTRY {
/*000*/	LIST_ENTRY LoadOrder;
/*008*/	LIST_ENTRY MemOrder;
/*010*/	LIST_ENTRY InitOrder;
/*018*/	DWORD ImageBase;	/* Used as HMODULE in Win32 API */
/*01C*/	DWORD EntryPoint;
/*020*/	ULONG ImageSize;
/*024*/	UNICODE_STRING PathFileName;
/*02C*/	UNICODE_STRING FileName;
/*034*/	ULONG ModuleFlags;
/*038*/	SHORT LoadCount;
/*03A*/	WORD Fill;
/*03C*/	LIST_ENTRY Link;	/* Points to entry in LdrpHashTable */
/*044*/	ULONG TimeDateStamp;
} MODULE_ENTRY, *PMODULE_ENTRY, **PPMODULE_ENTRY;

/*
 * Process Environment Block is located at 0x7FFDF000.
 */
typedef struct _PEB {
/*000*/	BOOLEAN InheritedAddressSpace;
/*001*/	BOOLEAN ReadImageFileExecOptions;
/*002*/	BOOLEAN BeingDebugged;
	BYTE b003;
	DWORD d004;
/*008*/	PVOID SectionBaseAddress;
/*00C*/	PPROCESS_MODULE_INFO ProcessModuleInfo;
/*010*/	PPROCESS_PARAMETERS ProcessParameters;
/*014*/	DWORD SubSystemData;
/*018*/	HANDLE ProcessHeap;
/*01C*/	PCRITICAL_SECTION FastPebLock;
/*020*/	VOID (*AcquireFastPebLock)(PCRITICAL_SECTION);
/*024*/	VOID (*ReleaseFastPebLock)(PCRITICAL_SECTION);
	DWORD d028;
/*02C*/	PPVOID User32Dispatch;
	DWORD d030;
	DWORD d034;
	DWORD d038;
/*03C*/	DWORD TlsBitMapSize;
/*040*/	PRTL_BITMAP TlsBitMap;
/*044*/	DWORD TlsBitMapData[2];
	PVOID p04C;
	PVOID p050;
/*054*/	PTEXT_INFO TextInfo;
/*058*/	PWCHAR InitAnsiCodePageData;
/*05C*/	PWCHAR InitOemCodePageData;
/*060*/	PSHORT InitUnicodeCaseTableData;
/*064*/	DWORD KeNumberProcessors;
/*068*/	DWORD NtGlobalFlag;
	DWORD d06C;
/*070*/	LARGE_INTEGER MmCriticalSectionTimeout;
/*078*/	DWORD MmHeapSegmentReserve;
/*07C*/	DWORD MmHeapSegmentCommit;
/*080*/	DWORD MmHeapDeCommitTotalFreeThreshold;
/*084*/	DWORD MmHeapDeCommitFreeBlockThreshold;
/*088*/	DWORD NumberOfHeaps;
/*08C*/	DWORD AvailableHeaps;
/*090*/	PHANDLE ProcessHeapsListBuffer;
	DWORD d094;
	DWORD d098;
	DWORD d09C;
/*0A0*/	PCRITICAL_SECTION LoaderLock;
/*0A4*/	DWORD NtMajorVersion;
/*0A8*/	DWORD NtMinorVersion;
/*0AC*/	WORD NtBuildNumber;
/*0AE*/	WORD CmNtCSDVersion;
/*0B0*/	DWORD PlatformId;
/*0B4*/	DWORD Subsystem;
/*0B8*/	DWORD MajorSubsystemVersion;
/*0BC*/	DWORD MinorSubsystemVersion;
/*0C0*/	KAFFINITY AffinityMask;
/*0C4*/	DWORD ad0C4[35];
	PVOID p150;
	DWORD ad154[32];
/*1D4*/	HANDLE Win32WindowStation;
	DWORD d1D8;
	DWORD d1DC;
/*1E0*/	PWORD CSDVersion;
	DWORD d1E4;
} PEB, *PPEB, **PPPEB;

/*
 * XXX should be in ntddk.h.
 */
typedef struct _PROCESS_BASIC_INFORMATION {
	NTSTATUS ExitStatus;
	PPEB PebBaseAddress;
	ULONG_PTR AffinityMask;
	KPRIORITY BasePriority;
	ULONG_PTR UniqueProcessId;
	ULONG_PTR InheritedFromUniqueProcessId;
} PROCESS_BASIC_INFORMATION, *PPROCESS_BASIC_INFORMATION;

typedef struct _PROCESS_DEVICEMAP_INFORMATION {
	union {
		struct {
			HANDLE DirectoryHandle;
		} Set;
		struct {
			ULONG DriveMap;
			UCHAR DriveType[32];
		} Query;
	};
} PROCESS_DEVICEMAP_INFORMATION, *PPROCESS_DEVICEMAP_INFORMATION;

typedef struct _THREAD_BASIC_INFORMATION {
	NTSTATUS ExitStatus;
	PNT_TIB TebBaseAddress;
	CLIENT_ID ClientId;
	KAFFINITY AffinityMask;
	KPRIORITY Priority;
	KPRIORITY BasePriority;
} THREAD_BASIC_INFORMATION, *PTHREAD_BASIC_INFORMATION;

typedef struct _KERNEL_USER_TIMES {
	LARGE_INTEGER CreateTime;
	LARGE_INTEGER ExitTime;
	LARGE_INTEGER KernelTime;
	LARGE_INTEGER UserTime;
} KERNEL_USER_TIMES, *PKERNEL_USER_TIMES;

/*
 * XXX should be in ntdef.h.
 */
typedef enum _NT_PRODUCT_TYPE {
	NtProductWinNt = 1,
	NtProductLanManNt,
	NtProductServer
} NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

/*
 * XXX should be in ntddk.h.
 */
#define PROCESSOR_FEATURE_MAX	64

#define KI_USER_SHARED_DATA	0xffdf0000
#define SharedUserData		((KUSER_SHARED_DATA * const)KI_USER_SHARED_DATA)

typedef struct _KSYSTEM_TIME {
	ULONG LowPart;
	LONG High1Time;
	LONG High2Time;
} KSYSTEM_TIME, *PKSYSTEM_TIME;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE {
	StandardDesign,
	NEC98x86,
	EndAlternatives
} ALTERNATIVE_ARCHITECTURE_TYPE;

typedef struct _KUSER_SHARED_DATA {
/*000*/	volatile ULONG TickCountLow;
/*004*/	ULONG TickCountMultiplier;
/*008*/	volatile KSYSTEM_TIME InterruptTime;
/*014*/	volatile KSYSTEM_TIME SystemTime;
/*020*/	volatile KSYSTEM_TIME TimeZoneBias;
/*02C*/	USHORT ImageNumberLow;
/*02E*/	USHORT ImageNumberHigh;
/*030*/	WCHAR NtSystemRoot[260];
/*238*/	ULONG MaxStackTraceDepth;
/*23C*/	ULONG CryptoExponent;
/*240*/	ULONG TimeZoneId;
/*244*/	ULONG Reserved2[8];
/*264*/	NT_PRODUCT_TYPE NtProductType;
/*268*/	BOOLEAN ProductTypeIsValid;
/*26C*/	ULONG NtMajorVersion;
/*270*/	ULONG NtMinorVersion;
/*274*/	BOOLEAN ProcessorFeatures[PROCESSOR_FEATURE_MAX];
	ULONG Reserved1;
	ULONG Reserved3;
	volatile ULONG TimeSlip;
	ALTERNATIVE_ARCHITECTURE_TYPE AlternativeArchitecture;
	LARGE_INTEGER SystemExpirationDate;
	ULONG SuiteMask;
#ifdef REMOTE_BOOT
	ULONG SystemFlags;
	WCHAR RemoteBootServerPath[260];
#endif
	BOOLEAN KdDebuggerEnabled;
} KUSER_SHARED_DATA, *PKUSER_SHARED_DATA;

/*
 * XXX should be in ntddk.h.
 */
typedef struct _TIME_FIELDS {
	CSHORT Year;
	CSHORT Month;
	CSHORT Day;
	CSHORT Hour;
	CSHORT Minute;
	CSHORT Second;
	CSHORT Milliseconds;
	CSHORT Weekday;
} TIME_FIELDS, *PTIME_FIELDS;

typedef struct _DESCRIPTOR_TABLE_ENTRY {
	ULONG Selector;
	LDT_ENTRY Descriptor;
} DESCRIPTOR_TABLE_ENTRY, *PDESCRIPTOR_TABLE_ENTRY;

/*
 * XXX should be in ntapi.h.
 */
typedef enum _HARDERROR_RESPONSE_OPTION {
	OptionAbortRetryIgnore,
	OptionOk,
	OptionOkCancel,
	OptionRetryCancel,
	OptionYesNo,
	OptionYesNoCancel,
	OptionShutdownSystem
} HARDERROR_RESPONSE_OPTION, *PHARDERROR_RESPONSE_OPTION;

typedef enum _HARDERROR_RESPONSE {
	ResponseReturnToCaller,
	ResponseNotHandled,
	ResponseAbort,
	ResponseCancel,
	ResponseIgnore,
	ResponseNo,
	ResponseOk,
	ResponseRetry,
	ResponseYes
} HARDERROR_RESPONSE, *PHARDERROR_RESPONSE;

/*
 * XXX those are not found in ntddk.h.
 */
typedef struct _ATOM_BASIC_INFORMATION {
	USHORT ReferenceCount;
	USHORT Pinned;
	USHORT NameLength;
	WCHAR Name[1];
} ATOM_BASIC_INFORMATION, *PATOM_BASIC_INFORMATION;

typedef struct _SYSTEM_BASIC_INFORMATION {
	ULONG Unknown;
	ULONG MaximumIncrement;
	ULONG PhysicalPageSize;
	ULONG NumberOfPhysicalPages;
	ULONG LowestPhysicalPage;
	ULONG HighestPhysicalPage;
	ULONG AllocationGranularity;
	ULONG LowestUserAddress;
	ULONG HighestUserAddress;
	ULONG ActiveProcessors;
	UCHAR NumberProcessors;
} SYSTEM_BASIC_INFORMATION, *PSYSTEM_BASIC_INFORMATION;

typedef struct _SYSTEM_SET_TIME_ADJUSTMENT {
	ULONG  TimeAdjustment;
	BOOLEAN  TimeSynchronization;
} SYSTEM_SET_TIME_ADJUSTMENT, *PSYSTEM_SET_TIME_ADJUSTMENT;

typedef struct _OBJECT_HANDLE_ATTRIBUTE_INFORMATION {
	BOOLEAN Inherit;
	BOOLEAN ProtectFromClose;
} OBJECT_HANDLE_ATTRIBUTE_INFORMATION, *POBJECT_HANDLE_ATTRIBUTE_INFORMATION;

typedef struct _FILE_MAILSLOT_QUERY_INFORMATION {
	ULONG MaxMessageSize;
	ULONG Unknown;
	ULONG NextSize;
	ULONG MessageCount;
	LARGE_INTEGER ReadTimeout;
} FILE_MAILSLOT_QUERY_INFORMATION, *PFILE_MAILSLOT_QUERY_INFORMATION;

typedef struct _FILE_MAILSLOT_SET_INFORMATION {
	PLARGE_INTEGER ReadTimeout;
} FILE_MAILSLOT_SET_INFORMATION, *PFILE_MAILSLOT_SET_INFORMATION;

typedef struct _FILE_ALLOCATION_INFORMATION {
	LARGE_INTEGER AllocationSize;
} FILE_ALLOCATION_INFORMATION, *PFILE_ALLOCATION_INFORMATION;

typedef struct _FILE_PIPE_INFORMATION {
	BOOL ReadModeMessage;
	BOOL NoWait;
} FILE_PIPE_INFORMATION, *PFILE_PIPE_INFORMATION;

typedef struct _FILE_PIPE_LOCAL_INFORMATION {
	ULONG MessageType;
	ULONG Unknown1;
	ULONG MaxInstances;
	ULONG CurInstances;
	ULONG InBufferSize;
	ULONG Unknown2;
	ULONG OutBufferSize;
	ULONG Unknown3[2];
	ULONG ServerEnd;
} FILE_PIPE_LOCAL_INFORMATION, *PFILE_PIPE_LOCAL_INFORMATION;

typedef struct _FILE_PIPE_REMOTE_INFORMATION {
	LARGE_INTEGER CollectDataTimeout;
	ULONG MaxCollectionCount;
} FILE_PIPE_REMOTE_INFORMATION, *PFILE_PIPE_REMOTE_INFORMATION;

typedef struct _FILE_NETWORK_OPEN_INFORMATION {
	LARGE_INTEGER CreationTime;
	LARGE_INTEGER LastAccessTime;
	LARGE_INTEGER LastWriteTime;
	LARGE_INTEGER ChangeTime;
	LARGE_INTEGER AllocationSize;
	LARGE_INTEGER EndOfFile;
	ULONG FileAttributes;
} FILE_NETWORK_OPEN_INFORMATION, *PFILE_NETWORK_OPEN_INFORMATION;

typedef struct _PROCESS_PRIORITY_CLASS {
	BOOLEAN Foreground;
	UCHAR PriorityClass;
} PROCESS_PRIORITY_CLASS, *PPROCESS_PRIORITY_CLASS;

typedef struct _PROCESS_SESSION_INFORMATION {
	DWORD SessionId;
} PROCESS_SESSION_INFORMATION, *PPROCESS_SESSION_INFORMATION;

typedef struct _SYSTEM_QUERY_TIME_ADJUSTMENT {
	ULONG TimeAdjustment;
	ULONG MaximumIncrement;
	BOOLEAN TimeSynchronization;
} SYSTEM_QUERY_TIME_ADJUSTMENT, *PSYSTEM_QUERY_TIME_ADJUSTMENT;

/*
 * Internal structure.
 * Used in RtlDosPathNameToNtPathName_U().
 */
typedef struct _RTL_PATH_NAME_INFO {
/*000*/	UNICODE_STRING PathName;
/*008*/	HANDLE Handle;
} RTL_PATH_NAME_INFO, *PRTL_PATH_NAME_INFO;

#define TH32_SNAPSHOT_HEAP		0
#define TH32_SNAPSHOT_PROCESS		1
#define TH32_SNAPSHOT_MODULE		2
#define TH32_SNAPSHOT_THREAD		3

typedef struct _TOOLHELP32_SNAPSHOT_HEADER {
	DWORD TotalEntries[4];
	DWORD FirstEntryOffset[4];
	DWORD RetrievedEntries[4];
} TOOLHELP32_SNAPSHOT_HEADER, *PTOOLHELP32_SNAPSHOT_HEADER;

typedef struct _BASE_STATIC_SERVER_DATA {
#if 0
	struct _SYSTEM_STRINGS;
#else
/*000*/	UNICODE_STRING SystemRoot;
/*008*/	UNICODE_STRING System32Root;
/*010*/	UNICODE_STRING NamedObjectName;
#endif
/*018*/	WORD Unknown_018[3];
/*01C*/	WORD Length;
/*020*/	WORD MaximumLength;
/*022*/	WCHAR RevisionName[130];	/* e.g. "Service Pack 3" */
/*128*/	DWORD Unknown_128;
/*12C*/	DWORD PageSize;
	DWORD Unknown_130;
	DWORD Unknown_134;
	DWORD Unknown_138;
/*13C*/	LPVOID LowestUserAddress;
	DWORD Unknown_140;
/*144*/	LPVOID HighestUserAddress;
/*148*/	DWORD_PTR AffinityMask;
} BASE_STATIC_SERVER_DATA, *PBASE_STATIC_SERVER_DATA;

/*
 * Inline functions.
 */

static inline PTEB
NtCurrentTeb(void)
{
	DWORD addr;

	__asm __volatile("movl %%fs:0x18,%0" : "=a" (addr));
	return (PTEB)addr;
}

/*
 * NTDLL API prototypes.
 *   Csr: client-server runtime
 *   Ldr: image loader
 *   Rtl: runtime library
 */

/*
 * Client-server runtime functions.
 */
NTSTATUS NTAPI CsrClientCallServer(PCSR_MESSAGE, PVOID, ULONG, LONG);

/*
 * Debug functions.
 */
void NTAPI DbgBreakPoint(void);
NTSTATUS NTAPI DbgUiContinue(PCLIENT_ID, DWORD);

/*
 * Image loader functions.
 */
NTSTATUS NTAPI LdrDisableThreadCalloutsForDll(HMODULE);
NTSTATUS NTAPI LdrGetDllHandle(LPWSTR, PVOID, PUNICODE_STRING, HMODULE *);
NTSTATUS NTAPI LdrGetProcedureAddress(HMODULE, PANSI_STRING, DWORD, PVOID *);
NTSTATUS NTAPI LdrLoadDll(LPCWSTR, PULONG, PUNICODE_STRING, HMODULE *);
VOID NTAPI LdrShutdownProcess(void);
